Vadimatorik/module_mc_hardware_interfaces_implementation_for_stm32/src/uart.cpp
#include "uart.h"

#include <string.h>

#ifdef HAL_UART_MODULE_ENABLED

namespace McHardwareInterfacesImplementation {

uart::uart (const uart_cfg *const cfg, uint32_t cfg_num) :
    cfg(cfg), cfg_num(cfg_num) {

    memset(&this->d, 0, sizeof(this->d));
    memset(&this->u, 0, sizeof(this->u));

    this->u.Init.HwFlowCtl = UART_HWCONTROL_NONE;
#ifdef UART_OVERSAMPLING_8
    this->u.Init.OverSampling = UART_OVERSAMPLING_8;
#elif UART_OVERSAMPLING_16
    this->uart.Init.OverSampling						= UART_OVERSAMPLING_16;
#endif
    this->u.Init.Parity = UART_PARITY_NONE;
    this->u.Init.StopBits = UART_STOPBITS_1;
    this->u.Init.WordLength = UART_WORDLENGTH_8B;
    
    if (cfg->dmaTx != nullptr) {
        this->u.hdmatx = &this->d;
        
        this->u.hdmatx->Init.Direction = DMA_MEMORY_TO_PERIPH;
        this->u.hdmatx->Init.PeriphInc = DMA_PINC_DISABLE;
        this->u.hdmatx->Init.MemInc = DMA_MINC_ENABLE;
        this->u.hdmatx->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        this->u.hdmatx->Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        this->u.hdmatx->Init.Mode = DMA_NORMAL;
        this->u.hdmatx->Init.Priority = DMA_PRIORITY_HIGH;
#if defined(STM32F2) || defined(STM32F4)
        this->u.hdmatx->Init.FIFOMode = DMA_FIFOMODE_DISABLE;
#endif
    }
    
    this->u.obj = this;
    
    this->m = USER_OS_STATIC_MUTEX_CREATE(&this->mb);
    this->s = USER_OS_STATIC_BIN_SEMAPHORE_CREATE(&this->sb);
}

mc_interfaces::res uart::reinit (uint32_t numberCfg) {

    if (numberCfg >= this->cfg_num)
        return mc_interfaces::res::errInputValue;
    
    this->clkDeinit();
    
    this->u.Instance = cfg[numberCfg].uart;
    this->u.Init.Mode = cfg[numberCfg].mode;
    this->u.Init.BaudRate = cfg[numberCfg].baudrate;
    this->u.hdmatx->Instance = this->cfg[numberCfg].dmaTx;
#if defined(STM32F2) || defined(STM32F4)
    this->u.hdmatx->Init.Channel = this->cfg[numberCfg].dmaTxCh;
#endif
    
    if (cfg[numberCfg].dmaTx != nullptr) {
        this->u.hdmatx = &this->d;
        this->u.hdmatx->Parent = &this->u;
        dmaClkOn(this->cfg->dmaTx);
        
        if (HAL_DMA_Init(&this->d) != HAL_OK)
            return mc_interfaces::res::errInit;
        
        dmaIrqOn(this->cfg->dmaTx, cfg[numberCfg].dmaTxPrio);
    }
    
    this->clkInit();
    
    HAL_StatusTypeDef r;
    
    r = HAL_UART_DeInit(&this->u);
    if (r != HAL_OK)
        return mc_interfaces::res::errInit;
    
    r = HAL_UART_Init(&this->u);
    if (r != HAL_OK)
        return mc_interfaces::res::errInit;
    
    if (this->cfg->de != nullptr) this->cfg->de->reset();
    
    return mc_interfaces::res::ok;
}

mc_interfaces::res uart::on (void) {
    if (this->u.gState == HAL_UART_STATE_RESET)
        return mc_interfaces::res::errInit;
    
    __HAL_UART_ENABLE(&this->u);
    //__HAL_UART_ENABLE_IT(&this->u, UART_IT_RXNE|UART_IT_PE|UART_IT_ERR);
    return mc_interfaces::res::ok;
}

void uart::off (void) {
    __HAL_UART_DISABLE(&this->u);
}

mc_interfaces::res uart::tx (const uint8_t *const txArray,
                                           uint16_t len,
                                           uint32_t timeout_ms) {
    USER_OS_TAKE_MUTEX(this->m, portMAX_DELAY);
    USER_OS_TAKE_BIN_SEMAPHORE (this->s, 0);
    
    if (this->cfg->de != nullptr) this->cfg->de->set();
    
    if (this->u.hdmatx != nullptr) {                                                // Если передача идет по DMA.
        HAL_UART_Transmit_DMA(&this->u, (uint8_t *)txArray, len);
    } else {                                                                    // Если по прерываниям.
        HAL_UART_Transmit_IT(&this->u, (uint8_t *)txArray, len);
    }
    
    mc_interfaces::res rv = mc_interfaces::res::errTimeOut;
    if (USER_OS_TAKE_BIN_SEMAPHORE (this->s, timeout_ms) == pdTRUE) {
        rv = mc_interfaces::res::ok;
    }
    
    if (this->cfg->de != nullptr) this->cfg->de->reset();
    
    USER_OS_GIVE_MUTEX(this->m);
    return rv;
}

mc_interfaces::res uart::get_byte (uint8_t *buf) {
    if (this->u.gState == HAL_UART_STATE_RESET) {
        return mc_interfaces::res::errInit;
    }
    
    /// Если есть данные.
    if (__HAL_UART_GET_FLAG(&this->u, UART_FLAG_RXNE)) {
        *buf = this->u.Instance->DR;
        return mc_interfaces::res::ok;
    }
    
    return mc_interfaces::res::errNotData;
}

mc_interfaces::res uart::get_byte (uint8_t *buf,
                                   uint32_t timeoutMs) {
    if (this->u.gState == HAL_UART_STATE_RESET) {
        return mc_interfaces::res::errInit;
    }
    
    /// Если есть данные.
    if (__HAL_UART_GET_FLAG(&this->u, UART_FLAG_RXNE)) {
        *buf = this->u.Instance->DR;
        return mc_interfaces::res::ok;
    }
    
    USER_OS_TAKE_MUTEX(this->m, portMAX_DELAY);
    USER_OS_TAKE_BIN_SEMAPHORE (this->s, 0);
    
    volatile mc_interfaces::res rv = mc_interfaces::res::errTimeOut;
    if (USER_OS_TAKE_BIN_SEMAPHORE (this->s, timeoutMs) == pdTRUE) {
        *buf = this->u.Instance->DR;
        rv = mc_interfaces::res::ok;
    }
    
    USER_OS_GIVE_MUTEX(this->m);
    
    return rv;
}

void uart::uart_irq_handler (void) {
    if (this->cfg->byte_handler) {
        if (__HAL_UART_GET_FLAG(&this->u, UART_FLAG_RXNE)) {
            this->cfg->byte_handler(this->u.Instance->DR);
        }
    }

    HAL_UART_IRQHandler(&this->u);
}

void uart::dma_irq_handler (void) {
    if (this->u.hdmatx != nullptr) {
        HAL_DMA_IRQHandler(this->u.hdmatx);
    }
}

extern "C" {

void HAL_UART_TxCpltCallback (UART_HandleTypeDef *huart) {
    ((uart *)huart->obj)->give_semaphore();
}

void HAL_UART_RxCpltCallback (UART_HandleTypeDef *huart) {
    ((uart *)huart->obj)->give_semaphore();
}

}


// Private.
void uart::give_semaphore (void) {
    if (this->s) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        USER_OS_GIVE_BIN_SEMAPHORE_FROM_ISR (this->s, &xHigherPriorityTaskWoken);
    }
}

bool uart::clkInit (void) {
    switch ((uint32_t)this->cfg->uart) {
#ifdef USART1
        case USART1_BASE:
            __HAL_RCC_USART1_CLK_ENABLE();
            return true;
#endif
#ifdef USART2
        case USART2_BASE:
            __HAL_RCC_USART2_CLK_ENABLE();
            return true;
#endif
#ifdef USART3
        case USART3_BASE:
            __HAL_RCC_USART3_CLK_ENABLE();
            return true;
#endif
#ifdef UART4
        case UART4_BASE:
            __HAL_RCC_UART4_CLK_ENABLE();
            return true;
#endif
#ifdef UART5
        case UART5_BASE:
            __HAL_RCC_UART5_CLK_ENABLE();
            return true;
#endif
#ifdef UART6
            case	UART6_BASE:		__HAL_RCC_UART6_CLK_ENABLE();		return true;
#endif
#ifdef UART7
            case	UART7_BASE:		__HAL_RCC_UART7_CLK_ENABLE();		return true;
#endif
#ifdef UART8
            case	UART8_BASE:		__HAL_RCC_UART8_CLK_ENABLE();		return true;
#endif
    };
    return false;
}

bool uart::clkDeinit (void) {
    switch ((uint32_t)this->cfg->uart) {
#ifdef USART1
        case USART1_BASE:
            __HAL_RCC_USART1_CLK_DISABLE();
            return true;
#endif
#ifdef USART2
        case USART2_BASE:
            __HAL_RCC_USART2_CLK_DISABLE();
            return true;
#endif
#ifdef USART3
        case USART3_BASE:
            __HAL_RCC_USART3_CLK_DISABLE();
            return true;
#endif
#ifdef UART4
        case UART4_BASE:
            __HAL_RCC_UART4_CLK_DISABLE();
            return true;
#endif
#ifdef UART5
        case UART5_BASE:
            __HAL_RCC_UART5_CLK_DISABLE();
            return true;
#endif
#ifdef UART6
            case	UART6_BASE:		__HAL_RCC_UART6_CLK_DISABLE();		return true;
#endif
#ifdef UART7
            case	UART7_BASE:		__HAL_RCC_UART7_CLK_DISABLE();		return true;
#endif
#ifdef UART8
            case	UART8_BASE:		__HAL_RCC_UART8_CLK_DISABLE();		return true;
#endif
    };
    return false;
}

}

#endif
